#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.rhelai_cloud_key: Refreshing state... [id=12e62081d0dce6672370aa3c18f9e33e9f772f7d]
aws_key_pair.rhelai_cloud_key: Refreshing state... [id=rhelai_cloud_key]
data.aws_ami.rhel: Reading...
aws_vpc.rhelai_vpc: Refreshing state... [id=vpc-04ef9ea0d3a53921e]
aws_iam_role.ec2_s3_access: Refreshing state... [id=ec2_s3_access_role]
aws_iam_role_policy.s3_access_policy: Refreshing state... [id=ec2_s3_access_role:s3_access_policy]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_s3_profile]
data.aws_ami.rhel: Read complete after 1s [id=ami-01b7cc65bddc01e4d]
aws_internet_gateway.rhelai_igw: Refreshing state... [id=igw-0127b302cefd4cec5]
aws_security_group.rhelai_security_group: Refreshing state... [id=sg-03b1c08b3b74afe68]
aws_subnet.rhelai_subnet: Refreshing state... [id=subnet-062dd50ab2a4bbd06]
aws_route_table.rhelai_pub_igw: Refreshing state... [id=rtb-0406a5060a675c87e]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-3906860249]
aws_security_group_rule.rhelai_ingress_access: Refreshing state... [id=sgrule-556643096]
aws_security_group_rule.ssh_ingress_access: Refreshing state... [id=sgrule-1351773181]
aws_security_group_rule.https_ingress_access: Refreshing state... [id=sgrule-1890307656]
aws_instance.rhelai_instance: Refreshing state... [id=i-03580ae00e5bb2e6b]
aws_route_table_association.rhelai_rt_subnet_public: Refreshing state... [id=rtbassoc-02bad4e867b2e6517]
null_resource.hostname_update: Refreshing state... [id=6949797278898113191]
ansible_host.rhelai_instance: Refreshing state... [id=ec2-18-217-135-251.us-east-2.compute.amazonaws.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group_rule.ssh_ingress_access will be created
  + resource "aws_security_group_rule" "ssh_ingress_access" {
      + cidr_blocks              = [
          + "98.97.81.235/32",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-03b1c08b3b74afe68"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # null_resource.hostname_update is tainted, so must be replaced
-/+ resource "null_resource" "hostname_update" {
      ~ id = "6949797278898113191" -> (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*